qppd/parcel-box/src/esp32/ParcelBoxEsp/ParcelBoxEsp.ino
#include <WiFi.h>
#include <Wire.h>
#include <LiquidCrystal_I2C.h>
#include <time.h>
#include <Preferences.h>

// Firebase library
#include <Firebase_ESP_Client.h>
// NOTE: TokenHelper.h and RTDBHelper.h are NOT included here.
// Their functions (printResult, tokenStatusCallback, getTokenType, etc.)
// are NOT called anywhere in the main code — including them causes
// multiple-definition linker errors since FirebaseManager.cpp also
// pulls them in. Only include if you actually call those helpers.

// Custom configuration modules
#include "PINS_CONFIG.h"
#include "FirebaseConfig.h"
#include "WiFiManagerCustom.h"
#include "ESPNOW_CONFIG.h"

// ESP-NOW library
#include <esp_now.h>
#include <esp_wifi.h>

// ============================================================================
// HARDWARE SERIAL PORTS
// ============================================================================
HardwareSerial sim800l(2);    // UART2 for SIM800L (GPIO16 RX / GPIO17 TX)
HardwareSerial qrScanner(1);  // UART1 for QR Scanner (GPIO33 RX / GPIO26 TX)

// ============================================================================
// SYSTEM STATE & SETTINGS
// ============================================================================
WiFiManagerCustom wifiManager;
Preferences preferences;

// ============================================================================
// I2C LCD INITIALIZATION
// ============================================================================
LiquidCrystal_I2C lcd(LCD_I2C_ADDRESS, LCD_COLS, LCD_ROWS);

// ============================================================================
// SYSTEM STATE STRUCTURE
// ============================================================================
struct SystemState {
  String device_id = "";
  String current_parcel_id = "";
  String current_qr_code = "";

  bool lock1_open = false;
  bool lock2_open = false;
  bool door1_open = false;
  bool door2_open = false;

  unsigned long last_scan_time = 0;
  unsigned long last_firebase_update = 0;
  unsigned long last_health_check = 0;
  unsigned long last_sms_time = 0;

  bool wifi_connected = false;
  bool firebase_connected = false;
  bool valid_scan = false;
} system_state;

// ============================================================================
// FIREBASE CONNECTION STATE
// ============================================================================
bool firebaseInitialized = false;
bool firebaseStreamReady = false;  // Tracks that streams were started

// ============================================================================
// ESP-NOW — SINGLE MANAGER
// ============================================================================
// Single callback-based ESP-NOW. No EspNowManager conflicts.
volatile bool espNowQrAvailable = false;
ESPNOW_QRPacket_t espNowPacket;
esp_now_peer_info_t camPeerInfo;

// Duplicate scan protection
static String lastProcessedEspNowQR = "";
static unsigned long lastEspNowProcessTime = 0;

// Firebase singleton objects (global for callback access)
FirebaseData fbdo;
FirebaseData commandStream;
FirebaseAuth auth;
FirebaseConfig fbConfig;

// Stream state
bool commandStreamActive = false;

// ============================================================================
// SERIAL MONITOR FLAGS
// ============================================================================
bool reed1_monitor = false;
bool reed2_monitor = false;
bool qr_monitor = false;
bool gsm_monitor = false;
unsigned long gsmRespTimeout = 0;
unsigned long lastReedPrint = 0;

// ============================================================================
// TIMING INTERVALS
// ============================================================================
const unsigned long FIREBASE_UPDATE_INTERVAL = 5000;       // 5 seconds
const unsigned long HEALTH_CHECK_INTERVAL = 30000;          // 30 seconds
const unsigned long RECONNECT_CHECK_INTERVAL = 10000;       // 10 seconds
const unsigned long QR_SCAN_TIMEOUT = 30000;                // 30 seconds

unsigned long lastFirebaseUpdate = 0;
unsigned long lastHealthCheck = 0;
unsigned long lastReconnectCheck = 0;

// ============================================================================
// STATE TRACKING FOR DIRTY-CHECK (prevents redundant Firebase writes)
// ============================================================================
bool prev_lock1 = false;
bool prev_lock2 = false;
bool prev_door1 = false;
bool prev_door2 = false;

// ============================================================================
// FUNCTION DECLARATIONS
// ============================================================================
void setup();
void loop();

void setupWiFi();
void initializeNTP();
void checkWiFiConnection();
void reconnectWiFi();

void setupI2C_LCD();
void displayLCD(String line1, String line2 = "", String line3 = "", String line4 = "");

void openLock(int lockNum);
void closeLock(int lockNum);
void playBuzzer(String tone_type);
void checkDoorSensors();
void handleDoorClosed(int doorNum);
void initSIM800L();
void resetSIM800L();
void sendSMS(String phone, String message);

void processGSM();
void handleParcelScanned(String qr_code);
void validateAndOpenLocks(String qr_code);
void closeLocksAfterDelivery();
void emergencyLockdown();
void resetSystem();

void processSerialCommands();
void printHelp();

// ESP-NOW — SINGLE PATH
void setupEspNow();
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
void onEspNowSent(const wifi_tx_info_t *wifi_tx_info, esp_now_send_status_t status);
#else
void onEspNowSent(const uint8_t *mac_addr, esp_now_send_status_t status);
#endif
void onEspNowReceived(const esp_now_recv_info_t *info, const uint8_t *data, int len);
void processEspNowQR();
void syncEspNowChannel();

// Firebase — SINGLE PATH
void initializeFirebase();
void registerDeviceInFirebase();
void updateFirebaseStatus();
void logParcelHistory(String parcel_id, String event);

// Firebase stream callbacks (static)
void commandStreamCallback(MultiPathStream stream);
void commandStreamTimeoutCallback(bool timeout);
void initCommandStream();
void handleFirebaseStream();

// Lock command callbacks
void onLockCommandFromFirebase(int lockNum, bool open);
void onEmergencyFromFirebase();

void generateDeviceId();
void checkSystemHealth();
void debugPrint(String msg);

// ============================================================================
// SETUP FUNCTION
// ============================================================================
void setup() {
  Serial.begin(BAUD_SERIAL);
  Serial.setTimeout(50);
  delay(500);

  Serial.println(F("================================================\n"
                   "Smart Parcel Locker - ESP32 Startup\n"
                   "================================================"));

  // ── Step 1: GPIO ──────────────────────────────────────────────────────────
  Serial.println(F("[SETUP 1/7] Initializing GPIO pins..."));
  pinMode(DOOR_SENSOR_1_PIN, INPUT_PULLUP);
  pinMode(DOOR_SENSOR_2_PIN, INPUT_PULLUP);
  pinMode(SIM800L_RST_PIN, OUTPUT);
  digitalWrite(RELAY_1_PIN, HIGH);
  digitalWrite(RELAY_2_PIN, HIGH);
  digitalWrite(SIM800L_RST_PIN, HIGH);
  ledcAttach(BUZZER_PIN, 1000, BUZZER_RESOLUTION);
  Serial.println(F("[SETUP 1/7] GPIO OK"));

