qppd/parcel-box/src/esp32/ParcelBoxEsp/ParcelBoxEsp.ino
  // ── Step 2: UARTs ─────────────────────────────────────────────────────────
  Serial.println(F("[SETUP 2/7] Initializing UARTs..."));
  sim800l.begin(BAUD_SIM800L, SERIAL_8N1, SIM800L_RX_PIN, SIM800L_TX_PIN);
  sim800l.setTimeout(50);
  qrScanner.setTimeout(100);
  Serial.println(F("[SETUP 2/7] UARTs OK"));

  // ── Step 3: I2C + LCD ────────────────────────────────────────────────────
  Serial.println(F("[SETUP 3/7] Initializing I2C + LCD..."));
  Wire.begin(LCD_SDA_PIN, LCD_SCL_PIN);
  setupI2C_LCD();
  displayLCD("PARCEL LOCKER", "Initializing...", "v2.0 (ESP32)", "");
  delay(1000);
  Serial.println(F("[SETUP 3/7] LCD OK"));

  // ── Step 4: Device ID ────────────────────────────────────────────────────
  Serial.println(F("[SETUP 4/7] Generating Device ID..."));
  generateDeviceId();
  Serial.println("[SETUP 4/7] Device ID: " + system_state.device_id);

  // ── Step 5: SIM800L ──────────────────────────────────────────────────────
  Serial.println(F("[SETUP 5/7] Initializing SIM800L..."));
  initSIM800L();
  Serial.println(F("[SETUP 5/7] SIM800L OK"));
  playBuzzer("startup");

  // ── Step 6: WiFi ─────────────────────────────────────────────────────────
  Serial.println(F("[SETUP 6/7] Starting WiFi..."));
  displayLCD("Setting up WiFi", "Join: ParcelBox", "_Setup or wait...", "pw: password123");
  setupWiFi();
  Serial.println("[SETUP 6/7] WiFi result: " + String(system_state.wifi_connected ? "CONNECTED" : "OFFLINE"));

  // ── Step 7: ESP-NOW + Firebase ──────────────────────────────────────────
  if (system_state.wifi_connected) {
    Serial.println(F("[SETUP 7/7] Initializing Communication System..."));
    displayLCD("Initializing", "Communications", "", "");

    // STEP 7a: ESP-NOW first (needs WiFi in STA mode)
    setupEspNow();

    // STEP 7b: Firebase second
    initializeFirebase();

    Serial.println("[SETUP 7/7] Communication result: " +
      String(firebaseInitialized ? "CONNECTED" : "FAILED"));
  } else {
    Serial.println(F("[SETUP 7/7] Communication SKIPPED (no WiFi)"));
  }

  // ── Ready ─────────────────────────────────────────────────────────────────
  displayLCD("SYSTEM READY", "Waiting for parcel",
             "WiFi: " + String(system_state.wifi_connected ? "OK" : "---"),
             "FB: " + String(system_state.firebase_connected ? "OK" : "---"));

  Serial.println();
  Serial.println("============================================");
  Serial.println("  PARCEL BOX READY - Type 'help' for cmds");
  Serial.println("  WiFi: " + String(system_state.wifi_connected ? "Connected" : "Offline"));
  Serial.println("  FB:   " + String(system_state.firebase_connected ? "Connected" : "Offline"));
  Serial.println("============================================");
}

// ============================================================================
// MAIN LOOP
// ============================================================================
void loop() {
  processSerialCommands();
  checkWiFiConnection();

  // ESP-NOW QR from ESP32-CAM (highest priority)
  processEspNowQR();

  // Process GSM responses
  processGSM();

  // Monitor door sensors
  checkDoorSensors();

  // Continuous reed switch monitoring output (only when enabled)
  if (reed1_monitor || reed2_monitor) {
    if (millis() - lastReedPrint >= 500) {
      lastReedPrint = millis();
      if (reed1_monitor) {
        Serial.println("[REED-1] " + String(digitalRead(DOOR_SENSOR_1_PIN) == HIGH ? "OPEN" : "CLOSED"));
      }
      if (reed2_monitor) {
        Serial.println("[REED-2] " + String(digitalRead(DOOR_SENSOR_2_PIN) == HIGH ? "OPEN" : "CLOSED"));
      }
    }
  }

  // ── Firebase: handle streaming command channel ──────────────────────────
  if (system_state.firebase_connected) {
    handleFirebaseStream();
  }

  // ── Firebase: update lock status (THROTTLED + DIRTY-CHECKED) ────────────
  if (system_state.firebase_connected && firebaseInitialized) {
    system_state.firebase_connected = Firebase.ready();
    if (system_state.firebase_connected) {
      bool lock1 = system_state.lock1_open;
      bool lock2 = system_state.lock2_open;
      bool door1 = system_state.door1_open;
      bool door2 = system_state.door2_open;

      // Only write to Firebase when state actually changes
      if (lock1 != prev_lock1 || lock2 != prev_lock2 ||
          door1 != prev_door1 || door2 != prev_door2) {
        updateFirebaseStatus();
        prev_lock1 = lock1;
        prev_lock2 = lock2;
        prev_door1 = door1;
        prev_door2 = door2;
      }

      // Periodic heartbeat (every 30s)
      if (millis() - lastHealthCheck > HEALTH_CHECK_INTERVAL) {
        lastHealthCheck = millis();
        if (firebaseInitialized && Firebase.ready()) {
          String devPath = ParcelBoxFirebaseConfig::getDeviceStatusPath();
          Firebase.RTDB.setInt(&fbdo, (devPath + "/" + system_state.device_id + "/last_heartbeat").c_str(), millis());
        }
        checkSystemHealth();
      }
    }
  }

  delay(10);  // Reduced from 50ms — watchdog-friendly, better responsiveness
}

// ============================================================================
// SERIAL COMMAND PROCESSING
// ============================================================================
void processSerialCommands() {
  if (!Serial.available()) return;

  String rawLine = Serial.readStringUntil('\n');
  rawLine.trim();
  if (rawLine.length() == 0) return;

  String cmd = rawLine;
  cmd.toLowerCase();

  Serial.print("[Serial] Cmd: "); Serial.println(rawLine);

  if (cmd == "relay-1:on") { openLock(1); Serial.println(F("[RELAY-1] ON")); }
  else if (cmd == "relay-1:off") { closeLock(1); Serial.println(F("[RELAY-1] OFF")); }
  else if (cmd == "relay-2:on") { openLock(2); Serial.println(F("[RELAY-2] ON")); }
  else if (cmd == "relay-2:off") { closeLock(2); Serial.println(F("[RELAY-2] OFF")); }
  else if (cmd == "buzzer:on") { ledcWriteTone(BUZZER_PIN, 1000); Serial.println(F("[BUZZER] ON")); }
  else if (cmd == "buzzer:off") { ledcWriteTone(BUZZER_PIN, 0); Serial.println(F("[BUZZER] OFF")); }
  else if (cmd == "lcd:test") { displayLCD("LCD TEST", "Line 2 OK", "Line 3 OK", "Line 4 OK"); }
  else if (cmd == "reed-1:read") { Serial.println("[REED-1] " + String(digitalRead(DOOR_SENSOR_1_PIN) == HIGH ? "OPEN" : "CLOSED")); }
  else if (cmd == "reed-1:mon:on") { reed1_monitor = true; Serial.println(F("[REED-1] Monitor ON")); }
  else if (cmd == "reed-1:mon:off") { reed1_monitor = false; Serial.println(F("[REED-1] Monitor OFF")); }
  else if (cmd == "reed-2:read") { Serial.println("[REED-2] " + String(digitalRead(DOOR_SENSOR_2_PIN) == HIGH ? "OPEN" : "CLOSED")); }
  else if (cmd == "reed-2:mon:on") { reed2_monitor = true; Serial.println(F("[REED-2] Monitor ON")); }
  else if (cmd == "reed-2:mon:off") { reed2_monitor = false; Serial.println(F("[REED-2] Monitor OFF")); }
  else if (cmd == "qr:mon:on") { qr_monitor = true; Serial.println(F("[QR] Monitor ON")); }
  else if (cmd == "qr:mon:off") { qr_monitor = false; Serial.println(F("[QR] Monitor OFF")); }
  else if (cmd == "gsm:mon:on") { gsm_monitor = true; Serial.println(F("[GSM] Monitor ON")); }
  else if (cmd == "gsm:mon:off") { gsm_monitor = false; Serial.println(F("[GSM] Monitor OFF")); }
  else if (cmd.startsWith("gsm:")) {
    String atCmd = rawLine.substring(4);
    atCmd.trim();
    Serial.print("[GSM] Sending: "); Serial.println(atCmd);
    sim800l.println(atCmd);
    gsmRespTimeout = millis() + 2000;
  }
  else if (cmd == "status") { checkSystemHealth(); }
  else if (cmd == "help") { printHelp(); }
  else { Serial.println("[ERR] Unknown: '" + cmd + "' | Type help"); }
}

void printHelp() {
  Serial.println(F("======= PARCEL LOCKER COMMANDS ======="
                   "\nrelay-1:on/off         Control lock 1"
                   "\nrelay-2:on/off         Control lock 2"
                   "\nbuzzer:on/off          Buzzer control"
                   "\nlcd:test               LCD test display"
                   "\nreed-1:read            Read reed switch 1"
                   "\nreed-1:mon:on/off      Continuous reed-1 monitor"
                   "\nreed-2:read            Read reed switch 2"
                   "\nreed-2:mon:on/off      Continuous reed-2 monitor"
                   "\nqr:mon:on/off          Print raw QR scanner data"
                   "\ngsm:<AT CMD>           Send AT command to SIM800L"
                   "\ngsm:mon:on/off         Forward GSM responses"
                   "\nstatus                 System health check"
                   "\nhelp                   Show this help"
                   "\n======================================"));
}

// ============================================================================
// LOCK CONTROL
// ============================================================================
void openLock(int lockNum) {
  int pin = (lockNum == 1) ? RELAY_1_PIN : RELAY_2_PIN;
  digitalWrite(pin, LOW);
  if (lockNum == 1) system_state.lock1_open = true;
  else system_state.lock2_open = true;
  debugPrint("Lock " + String(lockNum) + " OPENED");
  playBuzzer("click");
}

void closeLock(int lockNum) {
  int pin = (lockNum == 1) ? RELAY_1_PIN : RELAY_2_PIN;
  digitalWrite(pin, HIGH);
  if (lockNum == 1) system_state.lock1_open = false;
  else system_state.lock2_open = false;
  debugPrint("Lock " + String(lockNum) + " CLOSED");
}

// ============================================================================
// BUZZER
// ============================================================================
void playBuzzer(String tone_type) {
  if (tone_type == "startup") {
    for (int i = 0; i < 2; i++) { ledcWriteTone(BUZZER_PIN, 1000); delay(100); ledcWriteTone(BUZZER_PIN, 0); delay(50); }
  } else if (tone_type == "success") {
    for (int freq = 800; freq < 2000; freq += 50) { ledcWriteTone(BUZZER_PIN, freq); delay(20); }
  } else if (tone_type == "alert") {
    for (int i = 0; i < 5; i++) { ledcWriteTone(BUZZER_PIN, 2000); delay(50); ledcWriteTone(BUZZER_PIN, 0); delay(50); }
  } else if (tone_type == "click") {
    ledcWriteTone(BUZZER_PIN, 1500); delay(50);
  }
  ledcWriteTone(BUZZER_PIN, 0);
}

// ============================================================================
// DOOR SENSORS
// ============================================================================
void checkDoorSensors() {
  bool nd1 = digitalRead(DOOR_SENSOR_1_PIN) == HIGH;
  bool nd2 = digitalRead(DOOR_SENSOR_2_PIN) == HIGH;

  if (nd1 != system_state.door1_open) {
    system_state.door1_open = nd1;
    if (system_state.door1_open) {
      debugPrint("Parcel door OPENED");
    } else {
      debugPrint("Parcel door CLOSED");
      handleDoorClosed(1);
    }
  }

  if (nd2 != system_state.door2_open) {
    system_state.door2_open = nd2;
    if (system_state.door2_open) {
      debugPrint("Payment box door OPENED");
    } else {
      debugPrint("Payment box door CLOSED");
      handleDoorClosed(2);
    }
  }
}

void handleDoorClosed(int doorNum) {
  if (doorNum == 1) {
    system_state.lock1_open = false;
    debugPrint("Parcel door closed - marking as delivered");
    displayLCD("Parcel Locked", "Delivery complete", "", "");

