qppd/parcel-box/src/esp32/ParcelBoxEsp/ParcelBoxEsp.ino
    if (system_state.firebase_connected && system_state.current_parcel_id.length() > 0) {
      logParcelHistory(system_state.current_parcel_id, "PARCEL_DELIVERED");
    }

    delay(2000);
    displayLCD("READY", "Scan parcel QR",
               "WiFi: " + String(system_state.wifi_connected ? "OK" : "---"),
               "FB: " + String(system_state.firebase_connected ? "OK" : "---"));
    system_state.current_parcel_id = "";
    system_state.current_qr_code = "";
  } else if (doorNum == 2) {
    system_state.lock2_open = false;
    debugPrint("Payment box closed");
  }
}

// ============================================================================
// SIM800L GSM
// ============================================================================
void initSIM800L() {
  Serial.print(F("[SIM800L] Resetting"));
  digitalWrite(SIM800L_RST_PIN, LOW);
  delay(100);
  digitalWrite(SIM800L_RST_PIN, HIGH);
  for (int i = 0; i < 8; i++) { delay(500); Serial.print("."); }
  Serial.println(F(" boot done"));

  Serial.print(F("[SIM800L] AT... "));
  sim800l.println("AT");
  delay(500);
  if (sim800l.available()) {
    Serial.println("response: " + sim800l.readStringUntil('\n'));
  } else {
    Serial.println(F("no response (check wiring/power)"));
  }
  while (sim800l.available()) sim800l.read();
}

void resetSIM800L() {
  Serial.print(F("[SIM800L] Hardware reset"));
  digitalWrite(SIM800L_RST_PIN, LOW); delay(100);
  digitalWrite(SIM800L_RST_PIN, HIGH); delay(1000);
  Serial.println(F(" done"));
}

void sendSMS(String phone, String message) {
  if (millis() - system_state.last_sms_time < SMS_COOLDOWN) {
    debugPrint("SMS cooldown active");
    return;
  }
  debugPrint("Sending SMS to: " + phone);
  sim800l.println("AT+CMGF=1"); delay(100);
  sim800l.print("AT+CMGS=\""); sim800l.print(phone); sim800l.println("\""); delay(100);
  sim800l.print(message);
  sim800l.write(26);
  delay(1000);
  system_state.last_sms_time = millis();
  debugPrint("SMS sent!");
  playBuzzer("click");
}

// ============================================================================
// WIFI
// ============================================================================
void setupWiFi() {
  debugPrint("Initializing WiFi Manager...");
  if (!wifiManager.begin("ParcelBox_Setup", "password123")) {
    debugPrint("WiFi setup timeout");
    displayLCD("WiFi Timeout", "Will retry in", "offline mode", "");
    system_state.wifi_connected = false;
    return;
  }
  debugPrint("WiFi Connected!");
  debugPrint("IP Address: " + wifiManager.getLocalIP());
  displayLCD("WiFi Connected", "IP: " + wifiManager.getLocalIP(), "", "");
  system_state.wifi_connected = true;
  delay(2000);
  initializeNTP();
}

void initializeNTP() {
  debugPrint("Syncing time with NTP...");
  configTime(8 * 3600, 0, "pool.ntp.org", "time.nist.gov");
  time_t now = time(nullptr);
  int attempts = 0;
  while (now < 24 * 3600 && attempts < 20) { delay(500); now = time(nullptr); attempts++; }
  struct tm timeinfo = *localtime(&now);
  debugPrint("Time: " + String(asctime(&timeinfo)));
}

void checkWiFiConnection() {
  unsigned long now = millis();
  if (now - lastReconnectCheck < RECONNECT_CHECK_INTERVAL) return;
  lastReconnectCheck = now;

  bool connected = wifiManager.isConnected();

  if (!connected && system_state.wifi_connected) {
    debugPrint("WiFi connection lost!");
    system_state.wifi_connected = false;
    displayLCD("WiFi Disconnected", "Reconnecting...", "", "");
  }

  if (!connected) {
    wifiManager.reconnect();
  } else if (!system_state.wifi_connected) {
    debugPrint("WiFi reconnected!");

    // Re-init ESP-NOW after WiFi reconnect (WiFi channel may have changed)
    setupEspNow();

    system_state.wifi_connected = true;
    if (!firebaseInitialized) {
      initializeFirebase();
    }
  }
}

void reconnectWiFi() {
  wifiManager.reset();
  delay(1000);
  setupWiFi();
}

// ============================================================================
// LCD
// ============================================================================
void setupI2C_LCD() {
  lcd.init();
  lcd.backlight();
  lcd.clear();
  debugPrint("LCD Initialized");
}

void displayLCD(String line1, String line2, String line3, String line4) {
  lcd.clear();
  if (line1.length() > 0) { lcd.setCursor(0, 0); lcd.print(line1.substring(0, LCD_COLS)); }
  if (line2.length() > 0) { lcd.setCursor(0, 1); lcd.print(line2.substring(0, LCD_COLS)); }
  if (line3.length() > 0) { lcd.setCursor(0, 2); lcd.print(line3.substring(0, LCD_COLS)); }
  if (line4.length() > 0) { lcd.setCursor(0, 3); lcd.print(line4.substring(0, LCD_COLS)); }
}

// ============================================================================
// ESP-NOW — SINGLE INIT, SINGLE CALLBACK
// ============================================================================
void setupEspNow() {
  esp_err_t err;

  // 1. Ensure WiFi is STA mode
  WiFi.mode(WIFI_STA);

  // 2. Deinit first if already initialized (safe for reinit after reconnect)
  esp_now_deinit();

  // 3. Init fresh
  err = esp_now_init();
  if (err != ESP_OK) {
    Serial.printf("[ESPNOW] Init failed: %d\n", err);
    return;
  }

  // 4. Register callbacks
  esp_now_register_send_cb(onEspNowSent);
  esp_now_register_recv_cb(onEspNowReceived);

  // 5. Add CAM as peer
  memset(&camPeerInfo, 0, sizeof(camPeerInfo));
  camPeerInfo.channel = 0;  // Will be locked via esp_wifi_set_channel()
  camPeerInfo.encrypt = false;
  camPeerInfo.ifidx = WIFI_IF_STA;
  camPeerInfo.peer_addr[0] = CAM_MAC_0;
  camPeerInfo.peer_addr[1] = CAM_MAC_1;
  camPeerInfo.peer_addr[2] = CAM_MAC_2;
  camPeerInfo.peer_addr[3] = CAM_MAC_3;
  camPeerInfo.peer_addr[4] = CAM_MAC_4;
  camPeerInfo.peer_addr[5] = CAM_MAC_5;

  err = esp_now_add_peer(&camPeerInfo);
  if (err != ESP_OK) {
    Serial.printf("[ESPNOW] Peer add failed: %d\n", err);
  }

  // 6. Channel sync — force ESP-NOW to WiFi channel
  syncEspNowChannel();

  Serial.printf("[ESPNOW] Ready. MAC: %s, Channel: %d\n",
    WiFi.macAddress().c_str(), WiFi.channel());
}

