qppd/parcel-box/src/esp32/ParcelBoxEsp/ParcelBoxEsp.ino
void syncEspNowChannel() {
  if (WiFi.status() == WL_CONNECTED) {
    int ch = WiFi.channel();
    esp_wifi_set_channel(ch, WIFI_SECOND_CHAN_NONE);
    // Log only on change (no flooding)
    Serial.printf("[ESPNOW] Channel synced: %d\n", ch);
  }
}

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
void onEspNowSent(const wifi_tx_info_t *wifi_tx_info, esp_now_send_status_t status) {
#else
void onEspNowSent(const uint8_t *mac_addr, esp_now_send_status_t status) {
#endif
  // Only log failures to avoid flooding on ACKs
  if (status != ESP_NOW_SEND_SUCCESS) {
    Serial.println(F("[ESPNOW] Send FAILED"));
  }
}

void onEspNowReceived(const esp_now_recv_info_t *info, const uint8_t *data, int len) {
  // Verify packet size matches ESPNOW_QRPacket_t (42 bytes)
  if (len != sizeof(ESPNOW_QRPacket_t)) {
    // Silently discard mismatched packets — no serial spam
    return;
  }

  memcpy(&espNowPacket, data, sizeof(ESPNOW_QRPacket_t));

  // Sanitize QR data
  espNowPacket.qrData[31] = '\0';
  String qrClean = String(espNowPacket.qrData);
  qrClean.trim();
  qrClean.replace("\r", "");
  qrClean.replace("\n", "");
  strncpy(espNowPacket.qrData, qrClean.c_str(), 31);
  espNowPacket.qrData[31] = '\0';

  espNowQrAvailable = true;

  // Single clean print when QR arrives
  Serial.print(F("[QR RX] Received QR: "));
  Serial.println(espNowPacket.qrData);
}

void processEspNowQR() {
  if (!espNowQrAvailable) return;
  espNowQrAvailable = false;

  String qr_code = String(espNowPacket.qrData);

  // Duplicate protection
  if (qr_code == lastProcessedEspNowQR &&
      (millis() - lastEspNowProcessTime) < ESPNOW_DUPLICATE_COOLDOWN) {
    return;
  }

  lastProcessedEspNowQR = qr_code;
  lastEspNowProcessTime = millis();

  Serial.println("[ESPNOW] Processing QR: " + qr_code);
  displayLCD("QR via CAM", qr_code, "Validating...", "");
  handleParcelScanned(qr_code);
}

// ============================================================================
// FIREBASE — SINGLE PATH
// ============================================================================
void initializeFirebase() {
  if (firebaseInitialized) return;

  Serial.println(F("[FB] Initializing..."));

  // Configure
  fbConfig.host = ParcelBoxFirebaseConfig::getFirebaseHost();
  fbConfig.database_url = ParcelBoxFirebaseConfig::getDatabaseURL();
  fbConfig.signer.tokens.legacy_token = ParcelBoxFirebaseConfig::getFirebaseAuth();
  fbConfig.timeout.serverResponse = 10 * 1000;
  fbConfig.timeout.rtdbStreamReconnect = 1 * 1000;
  fbConfig.timeout.rtdbStreamError = 3 * 1000;

  // Set buffer sizes
  fbdo.setBSSLBufferSize(2048, 1024);
  fbdo.setResponseSize(2048);
  commandStream.setBSSLBufferSize(2048, 1024);
  commandStream.setResponseSize(2048);

  // Begin
  Firebase.begin(&fbConfig, &auth);
  Firebase.reconnectWiFi(true);

  Serial.print(F("[FB] Awaiting connection"));
  unsigned long start = millis();
  while (!Firebase.ready() && millis() - start < 10000) {
    Serial.print("."); delay(500);
  }
  Serial.println();

  if (Firebase.ready()) {
    Serial.println(F("[FB] ✅ Connected"));
    system_state.firebase_connected = true;
    firebaseInitialized = true;
    registerDeviceInFirebase();
    initCommandStream();
  } else {
    Serial.println(F("[FB] ❌ Connection FAILED"));
    firebaseInitialized = true;
  }
}

void registerDeviceInFirebase() {
  String path = String(ParcelBoxFirebaseConfig::getDeviceStatusPath()) + "/" + system_state.device_id;
  FirebaseJson json;
  json.set("device_id", system_state.device_id);
  json.set("model", "ParcelBox_ESP32");
  json.set("version", "2.0.0");
  json.set("wifi_connected", true);
  json.set("firebase_connected", true);
  json.set("last_heartbeat", millis());

  if (Firebase.RTDB.setJSON(&fbdo, path.c_str(), &json)) {
    debugPrint("Device registered in Firebase");
  } else {
    debugPrint("Register failed: " + String(fbdo.errorReason()));
  }
}

void updateFirebaseStatus() {
  if (!system_state.firebase_connected || !Firebase.ready()) return;

  String path = String(ParcelBoxFirebaseConfig::getLocksStatusPath()) + "/" + system_state.device_id;
  FirebaseJson json;
  json.set("lock1", system_state.lock1_open ? "open" : "closed");
  json.set("lock2", system_state.lock2_open ? "open" : "closed");
  json.set("door1", system_state.door1_open ? "open" : "closed");
  json.set("door2", system_state.door2_open ? "closed" : "open");
  json.set("timestamp/.sv", "timestamp");

  if (Firebase.RTDB.setJSON(&fbdo, path.c_str(), &json)) {
    // Print only once per state change — no flooding
    debugPrint("FB: Lock status updated");
  } else {
    debugPrint("FB update failed: " + String(fbdo.errorReason()));
  }
}

void logParcelHistory(String parcel_id, String event) {
  if (!system_state.firebase_connected || !Firebase.ready()) return;

  String path = String(ParcelBoxFirebaseConfig::getHistoryPath()) + "/" + system_state.device_id;
  FirebaseJson entry;
  entry.set("parcel_id", parcel_id);
  entry.set("event", event);
  entry.set("timestamp/.sv", "timestamp");
  entry.set("device_id", system_state.device_id);

  if (Firebase.RTDB.pushJSON(&fbdo, path.c_str(), &entry)) {
    debugPrint("History: " + parcel_id + " -> " + event);
  } else {
    debugPrint("History failed: " + String(fbdo.errorReason()));
  }
}

// ============================================================================
// FIREBASE STREAM — COMMAND CHANNEL
// ============================================================================
void initCommandStream() {
  if (!firebaseInitialized || !Firebase.ready()) return;

  String cmdPath = String(ParcelBoxFirebaseConfig::getDeviceStatusPath()) +
    "/" + system_state.device_id + "/commands";

  Serial.println("[FB] Starting command stream: " + cmdPath);

  if (!Firebase.RTDB.beginMultiPathStream(&commandStream, cmdPath)) {
    Serial.printf("[FB] Stream init failed: %s\n", commandStream.errorReason().c_str());
    commandStreamActive = false;
  } else {
    Firebase.RTDB.setMultiPathStreamCallback(&commandStream, commandStreamCallback, commandStreamTimeoutCallback);
    commandStreamActive = true;
    Serial.println(F("[FB] ✅ Command stream active"));
  }
}

void handleFirebaseStream() {
  if (!commandStreamActive) return;

  if (!Firebase.RTDB.readStream(&commandStream)) {
    int httpCode = commandStream.httpCode();
    if (httpCode < 0 || httpCode == FIREBASE_ERROR_HTTP_CODE_OK) {
      // stream data just not available yet — normal
      return;
    }
    Serial.printf("[FB] Stream error: %s\n", commandStream.errorReason().c_str());
    commandStreamActive = false;
    // Reinit on next loop
    initCommandStream();
  }
}

void commandStreamCallback(MultiPathStream stream) {
  if (stream.get("/lock1")) {
    String cmd = stream.value;
    cmd.replace("\"", "");
    if (cmd == "open" || cmd == "close") {
      Serial.println("[FB] Lock1 cmd: " + cmd);
      if (cmd == "open") { onLockCommandFromFirebase(1, true); }
      else { onLockCommandFromFirebase(1, false); }
    }
  }
  if (stream.get("/lock2")) {
    String cmd = stream.value;
    cmd.replace("\"", "");
    if (cmd == "open" || cmd == "close") {
      Serial.println("[FB] Lock2 cmd: " + cmd);
      if (cmd == "open") { onLockCommandFromFirebase(2, true); }
      else { onLockCommandFromFirebase(2, false); }
    }
  }
  if (stream.get("/emergency_unlock")) {
    if (stream.value == "true") {
      Serial.println(F("[FB] Emergency unlock commanded"));
      onEmergencyFromFirebase();
    }
  }
}

void commandStreamTimeoutCallback(bool timeout) {
  if (timeout) {
    Serial.println(F("[FB] Stream timeout"));
  }
  if (!commandStream.httpConnected()) {
    Serial.printf("[FB] Stream disconnected: %d\n", commandStream.httpCode());
    commandStreamActive = false;
  }
}

// ============================================================================
// FIREBASE COMMAND CALLBACKS
// ============================================================================
void onLockCommandFromFirebase(int lockNum, bool open) {
  if (open) {
    openLock(lockNum);
    displayLCD("Remote: Lock " + String(lockNum), "Opening...", "", "");
    logParcelHistory("remote", "REMOTE_LOCK_" + String(lockNum) + "_OPEN");
  } else {
    closeLock(lockNum);
    displayLCD("Remote: Lock " + String(lockNum), "Closing...", "", "");
    logParcelHistory("remote", "REMOTE_LOCK_" + String(lockNum) + "_CLOSE");
  }
}

