qppd/parcel-box/src/esp32/ParcelBoxEsp/ParcelBoxEsp.ino
void onEmergencyFromFirebase() {
  emergencyLockdown();
}

// ============================================================================
// PARCEL QR WORKFLOW
// ============================================================================
void processGSM() {
  if (sim800l.available()) {
    String line = sim800l.readStringUntil('\n');
    line.trim();
    if (line.length() > 0 && (gsm_monitor || millis() < gsmRespTimeout)) {
      Serial.print("[GSM] "); Serial.println(line);
    }
  }
}

void handleParcelScanned(String qr_code) {
  system_state.current_qr_code = qr_code;
  system_state.last_scan_time = millis();

  displayLCD("QR SCANNED", qr_code, "Validating...", "");

  if (system_state.firebase_connected) {
    logParcelHistory(qr_code, "QR_SCANNED");
  }

  validateAndOpenLocks(qr_code);
}

void validateAndOpenLocks(String qr_code) {
  debugPrint("Validating QR: " + qr_code);

  bool is_valid = false;

  if (system_state.firebase_connected && Firebase.ready()) {
    String parcelPath = String(ParcelBoxFirebaseConfig::getParcelsDatabasePath()) + "/" + qr_code;
    if (Firebase.RTDB.getJSON(&fbdo, parcelPath.c_str())) {
      if (fbdo.dataType() == "json") {
        is_valid = true;
        system_state.current_parcel_id = qr_code;
        debugPrint("Parcel found in Firebase");
        logParcelHistory(qr_code, "PARCEL_FOUND");
      }
    }
  } else {
    if (qr_code.length() >= 5) {
      is_valid = true;
      system_state.current_parcel_id = qr_code;
    }
  }

  if (is_valid) {
    debugPrint("QR Validation: SUCCESS");
    system_state.valid_scan = true;
    displayLCD("Access Granted", "Opening locks...", "", "");
    logParcelHistory(qr_code, "VALIDATION_SUCCESS");

    openLock(1);
    delay(LOCK_OPERATION_DELAY);
    openLock(2);
    delay(LOCK_OPERATION_DELAY);

    playBuzzer("success");
    displayLCD("DOORS OPEN", "Place parcel in box", "Complete payment", "Door closes auto");
    Serial.println(F("[AUTH] Valid parcel - Locks opened"));
  } else {
    debugPrint("QR Validation: FAILED");
    system_state.valid_scan = false;
    playBuzzer("alert");
    displayLCD("Access Denied", "Invalid QR Code", "Try again", "");
    logParcelHistory(qr_code, "VALIDATION_FAILED");
    delay(3000);
    displayLCD("READY", "Scan parcel QR",
               "WiFi: " + String(system_state.wifi_connected ? "OK" : "---"),
               "FB: " + String(system_state.firebase_connected ? "OK" : "---"));
  }
}

// ============================================================================
// HEALTH
// ============================================================================
void checkSystemHealth() {
  // Only print health if something changed
  Serial.println(F("\n=== System Health ==="));
  Serial.println("Uptime: " + String(millis() / 1000) + "s");
  Serial.println("WiFi: " + String(system_state.wifi_connected ? "Connected" : "Disconnected"));
  Serial.println("Firebase: " + String(system_state.firebase_connected ? "Connected" : "Disconnected"));
  Serial.println("Lock 1: " + String(system_state.lock1_open ? "OPEN" : "CLOSED"));
  Serial.println("Lock 2: " + String(system_state.lock2_open ? "OPEN" : "CLOSED"));
  Serial.println("Door 1: " + String(system_state.door1_open ? "OPEN" : "CLOSED"));
  Serial.println("Door 2: " + String(system_state.door2_open ? "OPEN" : "CLOSED"));
  Serial.println("=====================\n");
}

void closeLocksAfterDelivery() {
  debugPrint("Closing locks...");
  closeLock(1); delay(LOCK_OPERATION_DELAY);
  closeLock(2);
}

void emergencyLockdown() {
  debugPrint("EMERGENCY LOCKDOWN!");
  displayLCD("LOCKDOWN", "System Secured", "Contact Admin", "");
  closeLock(1); delay(LOCK_OPERATION_DELAY); closeLock(2);
  playBuzzer("alert");
  logParcelHistory("SYSTEM", "EMERGENCY_LOCKDOWN");
}

void resetSystem() {
  system_state.current_parcel_id = "";
  system_state.current_qr_code = "";
  system_state.lock1_open = false;
  system_state.lock2_open = false;
  system_state.valid_scan = false;
  closeLocksAfterDelivery();
  displayLCD("SYSTEM RESET", "Ready for next parcel", "", "");
}

void generateDeviceId() {
  uint8_t mac[6];
  WiFi.macAddress(mac);
  char macStr[18];
  snprintf(macStr, sizeof(macStr), "%02X%02X%02X%02X%02X%02X",
           mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  system_state.device_id = "PARCELBOX_" + String(macStr);
}

void debugPrint(String msg) {
  Serial.print("[ESP32] ");
  Serial.println(msg);
}